[
    {
        "gen": 1,
        "title": "Pokémon Red and Blue",
        "text": [
            "Pokémon Red Version and Pokémon Blue Version were the first Pokémon games to be released outside of Japan, becoming available in North America on September 28, 1998, in Australia and New Zealand on October 23, 1998 and in Europe on October 5, 1999. In North America, the pair closely followed the debut of the anime's English dub, which began airing on September 8, 1998, and within a year, Pokémon was well known as a popular Nintendo franchise.",
            "The games are available on the Nintendo 3DS Virtual Console between the Pokémon 20th Anniversary on February 27, 2016 and the discontinuation of the 3DS Nintendo eShop in March 2023.",
            "Unlike later generations, Red and Blue were not the same as their corresponding Japanese releases Pokémon Red and Green. Besides Pokémon distribution, the aspects of Red and Blue such as graphics, script, and sprite designs are instead based on Pokémon Blue.",
            "Despite being released towards the end of Game Boy's lifespan, they quickly became the best-selling non-bundled games released for the Game Boy as well as being the best-selling role-playing games of all time.`"
        ],
        "imgs": [
            "/assets/gen1_red.png",
            "/assets/gen1_blue.png"
        ],
        "title_screen": "/assets/gen1_titlescreen.webp",
        "reception": "The games received positive reviews from the press, receiving a perfect 10/10 \"Masterful\" rating from IGN. The games received an average score of about 89% on GameRankings, the second highest on the site for a core series Pokémon game, and the 3rd and 4th best score for a Game Boy title."
    },
    {
        "gen": 1,
        "title": "Pokémon Yellow",
        "text": [
            "Pokémon Yellow Version: Special Pikachu Edition (Japanese: ポケットモンスター　ピカチュウ Pocket Monsters Pikachu), often known as Pokémon Yellow Version, is the third Pokémon game for Game Boy released worldwide, as a solitary version of Pokémon Red and Blue Versions. In Japan, the game was the fourth Pokémon game released, as a second solitary version of Pocket Monsters Red & Green. Unlike other games, Pokemon Yellow was inspired by the anime.",
            "Similar to Red and Blue, Yellow arrived towards the end of the Game Boy's lifespan. It managed, though, to receive the title of second best-selling non-bundled game for its console, losing only to its predecessors.",
            "The game is available on the Nintendo 3DS Virtual Console between the Pokémon 20th Anniversary on February 27, 2016 and the discontinuation of the 3DS Nintendo eShop in March 2023.",
            "Generation VII remakes, titled Pokémon: Let's Go, Pikachu! and Let's Go, Eevee!, were released worldwide for the Nintendo Switch in November 2018, in celebration of Yellow's 20th anniversary in Japan."
        ],
        "imgs": [
            "/assets/gen1_yellow.webp"
        ],
        "reception": "Like Red and Blue, Yellow was also well received by the press. Like its predecessors, it received a perfect 10/10 \"Masterful\" rating from IGN. However, it was criticized as being \"just a stopgap to help us wait for the real sequels\". Yellow received a slightly lower average score than Red and Blue of about 85% on GameRankings. Despite this, it was the site's top rated Game Boy game in the year of its release, 1999.",
        "title_screen": "/assets/gen1_titlescreen2.png"
    },
    {
        "gen": 2,
        "title": "Pokémon Gold and Silver",
        "text": [
            "Pokémon Gold Version  and Pokémon Silver Version  were the first core series games of Generation II for the Game Boy Color.",
            "During development, the games had the tentative titles of Pocket Monsters 2 or Pokémon 2 and Pocket Monsters 2: Gold & Silver along with a provisional release date of \"late 1997\". The number 2 was dropped as of Nintendo Space World '97 in November 1997.",
            "Originally announced for a March 1998 release in Nintendo Space World '97, the games had their launch date postponed, with Nintendo issuing a public apology where it was claimed that the developers were worn out but fully committed to the project and that they required more time to expand and improve the games further. They were eventually released in Japan on November 21, 1999, in North America on October 15, 2000, and in Europe on April 6, 2001. In South Korea, Nintendo collaborated with Daewon to release the games in the country, which occurred on April 24, 2002; the Korean versions are solely compatible with the Game Boy Color, which was released there in 2000, also by Daewon.",
            "Unlike earlier games, Pokémon Gold and Silver take place in the Johto region, west of the region that the original games take place in, Kanto. However, Kanto can be traveled to later in the games.",
            "As Pokémon had become an international phenomenon already with the release of Pokémon Red and Blue and Pokémon Yellow in North America and other regions, the localized versions of these games were greatly expected. Much like Red and Green (Red and Blue overseas), Gold and Silver were followed shortly by a solitary version with minor changes, Pokémon Crystal, as well as remakes two generations later in the form of Pokémon HeartGold and SoulSilver for the Nintendo DS."
        ],
        "imgs": [
            "/assets/gen2_gold.png",
            "/assets/gen2_silver.png"
        ],
        "reception": "Gold and Silver were generally well received. IGN rated the games a \"Masterpiece\" 10/10, with the reviewer stating that \"after playing the game for dozens of hours\", he really couldn't think of a bad point to make about Pokémon Gold and Silver. Gaming magazine Famitsu gave them a score of 34 out of 40. Pokémon Gold and Silver hold a rating of 89.56% and 91.35%, respectively, on GameRankings.",
        "title_screen": "/assets/gen2_titlescreen.png"
    },
    {
        "gen": 2,
        "title": "Pokémon Crystal",
        "text": [
            "Pokémon Crystal Version is the third and final Generation II core series game for Game Boy Color. It was released as a solitary version to Pokémon Gold and Silver, which were released one year before. It was released in Japan on December 14, 2000, in North America on July 29, 2001, and in Europe on November 2, 2001.",
            "It featured various fixes and some new additions, most notably the introduction of the option to play as a girl. It takes place in the region of Johto like Gold and Silver, with access to Kanto granted later in the game, with the player's starting town being New Bark Town.",
            "The Japanese version had far more new features, all related to a mobile phone-related linking technology usable through the Mobile System GB when connecting a Mobile Game Boy Adapter to a Game Boy Color or Game Boy Advance (original or SP)."
        ],
        "imgs": [
            "/assets/gen2_crystal.webp"
        ],
        "reception": "Pokémon Crystal received good reviews, although they were not quite as positive as those of Pokémon Gold and Silver. Like Pokémon Yellow before it, and subsequently Pokémon Emerald, it was criticized for being too similar to its sister games, with IGN commenting \"there's not much in this edition that makes it a 'must buy' for folks who already own a copy or two of the previous editions.\" IGN still gave the game an \"Amazing\" rating of 9.0/10. It holds an average score of 79.86% on GameRankings, about 10% lower than Pokémon Gold and Silver.",
        "title_screen": "/assets/gen2_titlescreen2.webp"
    },
    {
        "gen": 3,
        "title": "Pokémon Ruby and Sapphire",
        "text": [
            "Pokémon Ruby Version and Pokémon Sapphire Version are the first paired core series of Generation III games that are set in the Hoenn region. They were released in Japan on November 21, 2002, in North America on March 19, 2003, in Australia on April 3, 2003 and in Europe on July 25, 2003.",
            "On March 15, 2003, the Pokémon Center New York held a party at which players could purchase Pokémon Ruby and Sapphire. The games were not sold in stores across North America until March 19, 2003.",
            "Like all paired games beforehand, Ruby and Sapphire were followed by a third version, Pokémon Emerald, two years later, and together they became the best-selling Game Boy Advance games of all time. Remakes of the games, in the form of Pokémon Omega Ruby and Alpha Sapphire, were released three generations later for the Nintendo 3DS in November 2014 worldwide."
        ],
        "imgs": [
            "/assets/gen3_ruby.webp",
            "/assets/gen3_sapphire.png"
        ],
        "reception": "Both games were well received, getting perfect ratings from GamePro and Cinescape. IGN rated the games an \"Amazing\" 9.5/10 and commented that they were a \"wonderful GBA follow-up to the immense Game Boy blockbuster.\" However, some reviews criticized the repetitive nature of the games, with Eurogamer commenting that \"apart from the occasional tense battle with a Gym Leader and the more sophisticated opponents later on in the game, the constant fighting and collecting mechanic gets very tired, very fast.\" Gaming magazine Famitsu gave them a score of 36 out of 40. Pokémon Ruby and Sapphire hold a rating of 84.21% and 84.03%, respectively, on GameRankings.",
        "title_screen": "/assets/gen3_titlescreen.webp"
    },
    {
        "gen": 3,
        "title": "Pokémon Emerald",
        "text": [
            "Pokémon Emerald Version is a solitary version to Pokémon Ruby and Sapphire, and is the fifth and final Generation III core series game. Like its predecessor, Pokémon Crystal, it added many features not present in the earlier paired versions. It was released in Japan on September 16, 2004, in North America on May 1, 2005, in Australia on June 9, 2005 and in Europe on October 21, 2005.",
            "It was the second highest-selling video game of 2005 in North America. It was also the third best-selling game for the Game Boy Advance, losing to the other Generation III games, Pokémon Ruby and Sapphire and Pokémon FireRed and LeafGreen."
        ],
        "imgs": [
            "/assets/gen3_emerald.jpg"
        ],
        "reception": "Many reviews criticized Emerald for being too similar to Ruby and Sapphire, with Game Informer stating that \"there simply aren't enough changes to make this a must-buy.\" However, IGN gave the game a \"Great\" rating of 8.0/10, stating that there are \"special, newly-created treats sprinkled throughout the experience to make experiencing this repeat worthwhile.\" Gaming magazine Famitsu gave Pokémon Emerald a score of 34 out of 40. It holds a rating of 76.65% on GameRankings, based on 29 reviews.",
        "title_screen": "/assets/gen3_titlescreen2.png"
    },
    {
        "gen": 3,
        "title": "Pokémon FireRed and LeafGreen",
        "text": [
            "Pokémon FireRed Version and Pokémon LeafGreen Version are a pair of core series Generation III games that are set in the Kanto region. They were released in Japan on January 29, 2004, in North America on September 9, 2004, in Australia on September 23, 2004 and in Europe on October 1, 2004.",
            "As the first remakes in the Pokémon franchise, the games revisit the original pair of Pokémon games, Pokémon Red and Green Versions. The remakes feature the characters, plot elements, and challenges from the originals, along with several updates introduced in Generation III.",
            "The Game Boy Advance Wireless Adapter was initially included with the games when they were first released, eliminating the need for Game Link Cables when trading between the two games (and later Pokémon Emerald). In later copies, it was sold separately.",
            "FireRed and LeafGreen went on to become the second best-selling games on the Game Boy Advance, only behind Pokémon Ruby and Sapphire. They also received Nintendo's Player's Choice awards.",
            "FireRed and LeafGreen are the first of two remakes to take place in the region of Kanto, and were followed by Generation VII games Pokémon: Let's Go, Pikachu! and Let's Go, Eevee! in 2018."
        ],
        "imgs": [
            "/assets/gen3_firered.webp",
            "/assets/gen3_leafgreen.webp"
        ],
        "reception": "The games were praised by critics for maintaining the same storyline as the original versions, and also for incorporating new events. Criticism was received, however, for the lack of graphical improvement from Ruby and Sapphire. Generally, the games scored highly. Nintendo Power magazine gave them 4.5/5,[8] while IGN rated the games an \"Amazing\" 9.0/10. Eurogamer, though, criticized the lack of 'evolution' from the series, giving the remakes a 7/10. Gaming magazine Famitsu gave the games a score of 33 out of 40. Pokémon FireRed and LeafGreen hold a rating of 81.92% and 80.78%, respectively, on GameRankings.",
        "title_screen": "/assets/gen3_titlescreen3.webp"
    },
    {
        "gen": 4,
        "title": "Pokémon Diamond and Pearl",
        "text": [
            "Pokémon Diamond Version  and Pokémon Pearl Version are Nintendo DS games that are the first core series Pokémon games of Generation IV. The games were released in Japan on September 28, 2006, in North America on April 22, 2007, in Australia on June 21, 2007, and in Europe on July 27, 2007. They take place in the Sinnoh region.",
            "They were followed by Pokémon Platinum, an enhanced version of these games. Remakes of the games, in the form of Pokémon Brilliant Diamond and Shining Pearl, were released four generations later for the Nintendo Switch on November 19, 2021 worldwide."
        ],
        "imgs": [
            "/assets/gen4_diamond.webp",
            "/assets/gen4_pearl.jpg"
        ],
        "reception": "Pokémon Diamond and Pearl were critically well received, with Nintendo Power calling them \"the ultimate Pokémon experience.\" The inclusion of Wi-Fi features and the voice chat feature were also praised. However, the games were criticized for their somewhat basic graphics, with IGN commenting that \"everything still has that Game Boy look to it.\" Despite this, Diamond and Pearl received a \"Great\" score of 8.5/10 on the site. Gaming magazine Famitsu gave them a score of 35 out of 40. Both Pokémon Diamond and Pearl hold a rating of 85% on Metacritic.",
        "title_screen": "/assets/gen4_titlescreen.webp"
    },
    {
        "gen": 4,
        "title": "Pokémon Platinum",
        "text": [
            "Pokémon Platinum Version is a solitary version to Pokémon Diamond and Pearl, and the third Generation IV core series title.",
            "The game was first seen on May 11, 2008 when a low-resolution cell-phone picture of an upcoming issue of CoroCoro magazine was leaked around the internet. On May 15, the magazine was officially released and the game was also officially confirmed by Nintendo. The game was released in Japan on September 13, 2008, in North America on March 22, 2009, in Australia on May 14, 2009, in Europe on May 22, 2009, and in Korea on July 2, 2009.",
            "Like previous third versions, the region and starting area remain the same as in previously released paired versions; in Platinum, the player begins their journey from Twinleaf Town and travels across all of Sinnoh."
        ],
        "imgs": [
            "/assets/gen4_platinum.webp"
        ],
        "reception": "Gaming magazine Famitsu gave Pokémon Platinum a score of 36 out of 40. IGN rated the game a \"Great\" 8.8/10, stating that \"Yes, it's still good. Even two years later.\" It holds a rating of 83% on Metacritic, based on 46 critic reviews.",
        "title_screen": "/assets/gen4_titlescreen2.webp"
    },
    {
        "gen": 4,
        "title": "Pokémon HeartGold and SoulSilver",
        "text": [
            "Pokémon HeartGold Version and Pokémon SoulSilver Version are paired Generation IV remakes of the Generation II games Pokémon Gold and Silver.",
            "Much like how Pokémon FireRed and LeafGreen revisited the Generation I story of Kanto, HeartGold and SoulSilver retell the story of Johto, with the player's starting town being New Bark Town. While the games feature several expansions in key areas, the overall plot follows the same direction as the original Gold and Silver. Some aspects exclusive to Crystal are also included. Like how FireRed and LeafGreen could link up with Ruby, Sapphire, and Emerald to complete the Pokédex by trading regionally exclusive Pokémon, HeartGold and SoulSilver can link up with Diamond, Pearl, and Platinum to obtain Pokémon unavailable in Johto and Kanto (such as the Sinnoh starters) and vice versa.",
            "Kris, despite being the female counterpart of Crystal's player character, is not included as the female player character, with a new character instead taking her place. Whether she is chosen to be the player character or not, this new character will still appear in the game. The unselected protagonist will take a pseudo-rival role similar to the unselected characters of Ruby, Sapphire, Emerald, Diamond, Pearl, and Platinum.",
            "The games were released on September 12, 2009 in Japan, February 4, 2010 in Korea, March 14, 2010 in North America, March 25, 2010 in Australia and March 26, 2010 in Europe (this excludes the Netherlands, and the Flemish part of Belgium due to an in-game save error, with the patched copies later released on April 2, 2010)."
        ],
        "imgs": [
            "/assets/gen4_heartgold.webp",
            "/assets/gen4_soulsilver.webp"
        ],
        "reception": "Gaming magazine Famitsu gave Pokémon HeartGold and SoulSilver a score of 37 out of 40. IGN rated the games a \"Great\" 8.5/10. Both Pokémon HeartGold and SoulSilver hold a rating of 87% on Metacritic.",
        "title_screen": "/assets/gen4_titlescreen3.png"
    },
    {
        "gen": 5,
        "title": "Pokémon Black and White",
        "text": [
            "Pokémon Black Version and Pokémon White Version are Nintendo DS games that are the first core series Pokémon games of Generation V. The games were released in Japan on September 18, 2010, in Europe on March 4, 2011, in North America on March 6, 2011, and in Australia on March 10, 2011. They take place in the Unova region. These games are enhanced on the Nintendo DSi and Nintendo 3DS families.",
            "Pokémon Black and White follow the trends set by previous games in the series. Unlike previous games, Pokémon introduced prior to Generation V cannot be obtained before completing the main story by defeating Team Plasma.",
            "The games' names were revealed on the official Japanese Pokémon website on April 9, 2010, and scans from the subsequent issue of the magazine leaked the following day, April 10.",
            "Pokémon Black and White were followed in 2012 by two sequels, Pokémon Black 2 and White 2, which are set two years after the events of Black and White. Pokémon Black 2 and White 2 are the second and final paired versions of Generation V."
        ],
        "imgs": [
            "/assets/gen5_white.png",
            "/assets/gen5_black.webp"
        ],
        "reception": "Gaming magazine Famitsu gave Pokémon Black and White a perfect score. The reviewers were highly impressed with the fresh approach that the game has taken, from the graphics to the new features to the diversity of the Pokémon. The reviewers were also impressed by the Wi-Fi and PC features. Very few games have received a perfect score of 40/40, the first of which was The Legend of Zelda: Ocarina of Time.\n        Game Informer gave the games 8.75 out of 10. Nintendo Power gave the games a 9.0 out of 10, calling them \"as addictive as ever.\" IGN rated the games an \"Amazing\" 9.0/10. Both Pokémon Black and White hold a rating of 87% on Metacritic.",
        "title_screen": "/assets/gen5_titlescreen.webp"
    },
    {
        "gen": 5,
        "title": "Pokémon Black 2 and White 2",
        "text": [
            "Pokémon Black Version 2 and Pokémon White Version 2 are Nintendo DS games that are the second and final paired versions of Generation V. They are sequels to Pokémon Black and White, respectively. These games are enhanced on the Nintendo DSi and Nintendo 3DS families.",
            "Both games were revealed on Pokémon Smash! by Junichi Masuda, and subsequently the official Japanese and international Pokémon websites, on February 26, 2012. They were released in Japan on June 23, 2012, in North America on October 7, 2012, in Australia on October 11, 2012, in Europe on October 12, 2012 and in South Korea on November 8, 2012.",
            "The games feature two new forms of Kyurem that serve as the game mascots of the games: Black Kyurem for Black 2 and White Kyurem for White 2."
        ],
        "imgs": [
            "/assets/gen5_black2.webp",
            "/assets/gen5_white2.webp"
        ],
        "reception": "Gaming magazine Famitsu gave Pokémon Black 2 and White 2 a score of 36 out of 40, lower than Black and White's perfect grade. IGN rated the games an \"Amazing\" 9.6/10, calling them more \"than just a slightly expanded repackaging of the latest generation's core titles (a la Pokémon Yellow, Crystal, Emerald or Platinum)\" and saying that they feature \"a stunning amount of fresh content\" over their predecessors, which received a 9.0/10 from the site. Both Pokémon Black 2 and White 2 hold a rating of 80% on Metacritic.",
        "title_screen": "/assets/gen5_titlescreen2.png"
    }
]